Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: IMPORTANT: The package ID cannot be changed once your asset has been created.
zh_cn: 重要提示：创建资产后，无法更改程序包ID。

source: IN PROGRESS
zh_cn: 进行中

source: INSTALLED
zh_cn: 已安装

source: IP Address
zh_cn: IP 地址

source: IP Address:
zh_cn: IP地址：

source: Icon
zh_cn: 图标

source: Icon File:
zh_cn: 图标文件：

source: Icon for hdpi
zh_cn: 高分辨率（HDPI）图标

source: Icon for ldpi
zh_cn: 低分辨率（LDPI）图标

source: Icon for mdpi
zh_cn: 中分辨率（MDPI）图标

source: Icon for xhdpi
zh_cn: 超高分辨率（XHDPI）图标

source: Icon for xxhdpi
zh_cn: 极高分辨率（XXHDPI）图标

source: Icon for xxxhdpi
zh_cn: 最高分辨率（XXXHDPI）图标

source: Iconic Background Colour
zh_cn: 图标的背景色

source: Iconic Message
zh_cn: 图标的信息

source: Iconic Wide 1 Content
zh_cn: 宽图标1的内容

source: Iconic Wide 2 Content
zh_cn: 宽图标2的内容

source: Iconic Wide 3 Content
zh_cn: 宽图标3的内容

source: Iconic tiles
zh_cn: 图标块

source: Icons
zh_cn: 图标

source: Icons:
zh_cn: 图标：

source: Ideally you want to be using the most up-to-date runtime, but sometimes it may have an issue, or you may be required to use an older one for comparability, etc... and so you can change the runtime tools that GameMaker Studio 2 uses to build your game here.
zh_cn: 理想情况下，你希望使用最新的运行库，但某些情况可能会出现问题，为了兼容，或许你需要使用旧的版本等等……因此你可以更改 GameMaker Studio 2 使用的运行库工具来创建你的游戏。

source: Identifier
zh_cn: 标识符

source: Identity
zh_cn: 标识

source: If Any Object At
zh_cn: 如果任意物体的位置在...

source: If Any Object At Place
zh_cn: 如果有实例位于

source: If Audio Is Paused
zh_cn: 如果音频被暂停

source: If Audio Is Playing
zh_cn: 如果音频正在播放

source: If Buffer Exists
zh_cn: 如果存在缓冲区

source: If Collision Point
zh_cn: 如果与点发生碰撞

source: If Collision Shape
zh_cn: 如果形状发生碰撞

source: If Data Structure Empty
zh_cn: 如果数据结构为空

source: If Data Structure Exists
zh_cn: 如果数据结构存在

source: If End Of Buffer
zh_cn: 如果是缓冲区的结束点

source: If Expression
zh_cn: 如果表达式...

source: If File Exists
zh_cn: 如果文件存在

source: If Gamepad Button Down
zh_cn: 如果手柄按钮压住

source: If Gamepad Button Pressed
zh_cn: 如果手柄按钮按下

source: If Gamepad Button Released
zh_cn: 如果手柄按钮松开

source: If Health
zh_cn: 如果键康值...

source: If Instance Exists
zh_cn: 如果实例存在

source: If Key Down
zh_cn: 如果键位压住

source: If Key Pressed
zh_cn: 如果键位按下

source: If Key Released
zh_cn: 如果键位松开

source: If Lives
zh_cn: 如果生命数...

source: If Mouse Down
zh_cn: 如果鼠标压住

source: If Mouse Pressed
zh_cn: 如果鼠标按下

source: If Mouse Released
zh_cn: 如果鼠标放开

source: If Object At
zh_cn: 如果物体在...

source: If Object At Place
zh_cn: 如果物体位于

source: If Room Is First
zh_cn: 如果房间是第一个

source: If Room Is Last
zh_cn: 如果房间是最后一个

source: If Score
zh_cn: 如果分数...

source: If Undefined
zh_cn: 如果未定义...

source: If Variable
zh_cn: 如果变量...

source: If Virtual Keyboard Showing
zh_cn: 如果虚拟键盘正在显示

source: If a notification exists, the map is populated and the code then checks the "data" key for a specific string.
zh_cn: 如果通知存在， map 将被赋值，通过代码查找key为 "data"的特定字符串。

source: If any of the following examples resolves to true then the code would be run:
zh_cn: 如果下面的例子得出 true ，“{}”里面的代码将会执行。

source: If blank this will inherit the value set in Platform Options
zh_cn: 如果为空则将继承平台选项中设置的值。

source: If for example we wanted to make 6, we would add 4 and 2 together like so.
zh_cn: 例子的话，比如我们需要是 6，我们需要将 4 和 2 添加到一起，像这样：

source: If it does exist, it then checks to see which view is currently being drawn and if it is view[1] it draws the surface.
zh_cn: 如果存在，然后会检测当前视野是哪一个，是 view[1]的话就绘制表面。

source: If it meets any of the required values then the corresponding code is executed.
zh_cn: 遇到了适当的条件后运行相应的代码。

source: If lost, you cannot submit app updates to Google Play or Amazon
zh_cn: 如果丢失，则无法向 Google Play 或亚马逊提交应用更新

source: If no case statement has the right value, execution is continued after the default statement (it is not required to have a default statement, in which case no action will be taken).
zh_cn: 如果没有一个case表达式正确，将会在“default”语句后继续（default并非必须，那时没有动作执行）。

source: If off, the code will not be styled, while when on it will be styled using the formatting given above in the Colour section.
zh_cn: 如果关闭，代码将不会样式化，而打开它将会使用上面的颜色选项中给定的格式进行样式化处理。

source: If querying the status, a System event of type "keyboard status" is raised.
zh_cn: 如果查询状态，则会引发类型为“键盘状态”的系统事件。

source: If set to "Show message", you will be shown the dialogue when you want to close the debugger, while setting it to "Yes" or "No" will not show this dialogue and perform the task as indicated.
zh_cn: 如果设置为“相思消息”，则当关闭调试器时，将显示对话框，而将其设置为“是”或“否”则不会显示对话框并执行指定任务。

source: If that port is unavailable, it will then loop through the ports to find one that is.
zh_cn: 若端口不可用，则会遍历所有端口并找到合适的进行连接。

source: If that sounds complicated, then another way to look at a parent object is as a way to "group" objects together under the same umbrella and have them share certain things without losing their own unique identity.
zh_cn: 如果这听起来很复杂，那么另一种查看父对象的方法就是将对象“集体”在一起，同时保持共享，让他们分享某些东西，而不会失去自己独特的身份。

source: If the counter moves from 15 to 16, we end up with bit pattern 10000, and if we then AND with 15 (bit pattern 01111) we end up with 0.
zh_cn: 如果计数器从 15 移动到 16，我们得到的是按位显示的 10000，如果我们将其与得 15(位模式 01111)进行与运算，就会得到 0。

source: If the current view is anything other than view[0] the surface "surf" is drawn to the screen.
zh_cn: 如果当前视野不是view[0]，则绘制 "surf"这个表面到屏幕上。

source: If the file doesn't already contain the style definition it will search all files within its folder.\nUse 'Save Style As...' to explicitly override save file
zh_cn: 如果这个文件中不包含样式定义，它将搜索文件夹中的所有文件。\n可以直接使用“样式另存为”重写保存的文件。

source: If the global variable evaluates to false, then the sound has its volume set to 1.
zh_cn: 若该全局变量求值为false，则该声音的音量会被设置为1, then the sound has its volume set to 1.

source: If the problem persists please reinstall GameMaker Studio 2.
zh_cn: 如果问题仍然存在，请重新安装 GameMaker Studio 2。

source: If the project is closed or reloaded, it may be broken until manually resolved.
zh_cn: 如果项目已关闭或重新加载，则可能会在手动解决之前将其中断。

source: If the runtime has not been downloaded and installed, then you will be prompted to do so, and once it has been installed you will be prompted to close and restart the IDE so that the new runtime can be initialised.
zh_cn: 如果尚未下载安装，系统则会提示您，安装完毕后，系统将提示您关闭并重新启动 IDE，以便初始化新的运行库。

source: If the string is found, the notification is cancelled and moves on to check the next notification until all in the queue have been checked.
zh_cn: 如果找到该字符串,则通知取消,继续检查队列中的下一个通知,直到所有通知都被检查。

source: If the the instance code being stepped through has the watched variable it will be shown here, meaning you can easily keep track of a value without having to search for it in the Locals or Globals windows.
zh_cn: 如果按步跳过的实例代码中包含被监视的变量，那么它就会在这里显示出来。这意味着你可以轻易追踪变量而不用在Locals（局部）或者Globals（全局）窗口中查找它。

source: If the view is not view[0] the surface is drawn to the screen.
zh_cn: 如果当前视野不是 view[0]，将表面层绘制到屏幕上。

source: If they stop overlapping and overlap subsequently there will be another collision event triggered.
zh_cn: 如果它们随后停止重叠和重叠，则会触发另一个碰撞事件。

source: If this is un-checked, they will open in a window chained to the object event editor.
zh_cn: 如果未勾选，将在物体事件编辑器相关的窗口中打开。

source: If this is un-checked, they will open in a window within the current workspace.
zh_cn: 如果没有勾选上，将在当前工作区的窗口中打开。

source: If we are moving right, and we've moved into a collision block, then as we know everything is aligned to 32, so we need to also align the sprite to a 32 pixel boundary - preferably the one to the left - so the sprite is moved OUT of the collision.
zh_cn: 如果我们正在向右移动，然后我们已经移动到了一个碰撞块，并且我们知道一切都是对齐到 32 的，所以我们也需要使精灵对齐到 32 像素的边界——最好是左边的，然后精灵就会移出碰撞块。

source: If we had 64 1000000, then it becomes this... 1000000 & 0111111 which DOES leave us 0, so it's TRUE.
zh_cn: 如果是 64（1000000），那么它就变成了...1000000 & 0111111，计算结果为 0，所以会返回 TRUE。

source: If we perform an AND of this, and it comes out "not zero", then we know if the key can open the door.
zh_cn: 如果我们执行一个与运算，结果 "不为0 "，那么我们就知道这把钥匙可以开门了。

source: If we start doing values outside of the range of a byte (which can store numbers from 0 to 255), it does start to get a little harder to track.
zh_cn: 如果我们开始造一个字节（存储 0 至 255 之间的数字）以外的值，难度会开始变大。

source: If we wanted the key to open door 1 and 3, then the key would have the MASK of 5 (which is 101 in binary).
zh_cn: 如果我们想让钥匙打开 1 号门和 3 号门，那么钥匙的掩码是 5 (二进制是 101)。

source: If we wanted to align to the right, then we'd do the above, but then add 32 to move it into the next tile.
zh_cn: 如果我们想对齐到右边，那么我们会做上面的操作，然后加上 32 将其移动到下一个图块中。

source: If we wanted to set the second bit, we would do this:
zh_cn: 如果我们想要设置第二个位，我们要这样做：

source: If we were doing this in assembler, we actually get BOTH values in one divide, but you don't get this in high level languages (well… not very often), and so you have to do all the work twice.
zh_cn: 假如我们是在汇编语言（Assembler）上完成这件事，我们实际上会在一次除法当中同时得到这两个值，但是在高级语言中你不会得到这种结果（应该说，不是很常见），并且因此你必须做两次所有的工作。

source: If you also want to execute the parent event you can call the so-called "inherited" event using the appropriate action or code.
zh_cn: 如果还要执行父事件，可以使用相应的操作或代码调用所谓的“继承”事件。

source: If you are a more experienced programmer, then you can use the propriety scripting language GML to create your games, or you can even combine both and call GML functions with (and from) DnD™ actions, giving you a great deal of flexibility when it comes to how you write things.
zh_cn: 如果你是一个更有经验的程序员，你更适合使用脚本语言 GML 创建你的游戏，或者你甚至可以结合两者，使用DnD™动作调用函数，在你写代码的时候，给你极大的灵活性。

source: If you are new to using a scripting language then it is recommended that you start with the GML Overview, otherwise just use the reference guide to check up on function names when required:
zh_cn: 如果你是脚本使用的新手，建议从GML概述开始，不然只需要使用参考指南去查找所需要的函数名就可以了：

source: If you are using GameMaker Studio 2 on a laptop, then you will have a further option at the top of the IDE for Laptop Mode:
zh_cn: 如果你正在一个笔记本电脑上使用GameMaker Studio 2，那么在IDE的顶端会有一个选项为笔记本模式（Laptop Mode）：

source: If you are using the Arc Tool then here you can set the different colours used to draw the node properties:
zh_cn: 如果你使用了弧线工具（Arc Tool）那么你可以在这里设置用于绘制节点属性的各种颜色：

source: If you choose "No", then frame edition will be silently cancelled when you change tools.
zh_cn: 如果你选“否”（No），则帧编辑器会在你改变工具时静默地取消修改。

source: If you choose manual you will be able to set the bounding box values left, right, top and bottom.
zh_cn: 如果您选择手动，您将能够设置左上右下的边界框值。

source: If you click on, for example, the Resource Tree tab at the top and drag it to the left of the current workspace, you will see that it becomes a free floating window.
zh_cn: 例如，如果您单击 顶部的“资源树”选项卡并将其拖动到当前工作空间的左侧，您将看到它成为一个自由浮动窗口。

source: If you click on it, you will be asked to supply a file, and then once that is done you should click on OK.
zh_cn: 如果你点击它，会要求你提供一个文件。

source: If you click the Windows option, you will be shown a list of all the currently open windows within the workspace and you can select any of them to have the workspace focus on that window.
zh_cn: 如果您单击 窗口 选项，将会显示工作区中所有打开窗口的列表，您可以选择其中任何一个来将工作区焦点放在该窗口上。

source: If you close the output window and wish to recover it you can use the Windows Menu.
zh_cn: 如果您关闭了输出窗口并希望恢复，可以使用 窗口菜单 （来恢复）。

source: If you close the resources window and wish to recover it you can use the Windows Menu.
zh_cn: 如果关闭资源窗口并希望恢复，可以使用 窗口菜单。

source: If you do not have an appropriate sprite yet, you can click on the New Sprite button to create a new sprite resource and edit it as you wish, just as if you had created the resource through the standard resource create options, only now it will automatically be assigned to the object that you had open when you started to create it.
zh_cn: 如果你还没有合适的精灵，你可以点击 创建精灵按钮 来创建一个新的精灵资源并按照你的意愿来进行编辑，就像你通过标准资源创建选项来创建资源一样，只是现在它会自动分配给您开始创建前所打开的物体。

source: If you do not use this function (the default setting) then the GUI layer will be positioned with its (0,0) point at the same position as that for the application surface (the area where your game is being drawn) and the width and height will be stretched to fit the this surface, such that setting a GUI width of 256px with this function when the application surface is 512px would stretch those 256 pixels to fit, effectively making the pixels twice as large.
zh_cn: 如果你没有使用这个函数 (默认设置)， GUI层将被放置在同应用表面（游戏绘制的区域）一样的 (0,0)位置，宽度和高度将被拉伸以适合这个表面层，使用这个函数这样设置时宽度为256px的 GUI，当应用表面层是512px时，将会拉伸256像素为表面层的大小，使得像素放大两倍。

source: If you do nothing else at this point, when you run your game you will simply get a blank screen as all drawing is being done on the surface, but the surface itself is not being drawn anywhere.
zh_cn: 如果不做到这一步，运行游戏时将会简单的获得一个空白的屏幕，因为所有的绘制都是在表面里完成的，但是表面层并不会在任何地方绘制出来。

source: If you do supply the extra value for initialising the array, then all indices within the new array will be set to that instead of 0, but note that the function will take longer to run.
zh_cn: 如果你额外提供了一个值用于初始化这个数组，那么新数组中的所有索引元素都将被设置为该值而非0，但请注意，这样一来函数也将需要花费更多的时间来运行。

source: If you don't have a certificate, you can create one:
zh_cn: 如果没有证书，请创建一个：

source: If you fire off a series of cloud_ requests then you need to know which one you are getting the reply to, and so you would use this value to compare to the value you stored when you originally sent the request to find the right one.
zh_cn: 如果你发送了一系列的 cloud_ 请求，你需要知道被回应的是哪一个，所以你要用这个值来和发送时存储的值进行比较来找到你需要的请求。

source: If you have rectangular mask, then you can move any of the four corners, but the corresponding ones will adjust position automatically to always maintain a rectangle
zh_cn: 如果您有矩形掩码，则可以移动四个角中的任何一个，但相应的角将自动调整位置，以始终保持矩形

source: If you have a circular mask, then you can only pull any of the path points to make the circle diameter larger or smaller
zh_cn: 如果您有一个圆形遮罩，则只能拉任何路径点，使圆直径更大或更小

source: If you have a custom (polygon) mask, it must have a minimum of 3 and a maximum of 8 points to it, and it must be convex (see image below).
zh_cn: 如果您有一个自定义（多边形）掩码，它必须至少为3，最多为8个点，并且必须为凸面（请参见下图）。

source: If you have a previously created certificate then you can click the file browser button here and add it in to the forum, but if you do not have a certificate and wish to make one, then you should omit any information here and instead click to the Create New Certificate button explained below.
zh_cn: 如果你之前创建了一个整数那么你可以点击此处的文件浏览按钮来将其添加到社区当中，但如果你没有证书文件而想要有一个，那么你应该忽略此处所有信息而去点击下文将要解释的创建新证书（Create New Certificate）按钮

source: If you have initialised any buffers in your game, then this window will show you the buffer data.
zh_cn: 如果你在游戏中初始化了缓冲器，这个窗口会给你显示缓冲数据。

source: If you have not previously made a certificate file for using the Marketplace, then you should click the button labelled Create New Certificate at the bottom of this form.
zh_cn: 如果你之前没有为市场创建一个证书文件的话，那么你需要点击表单底部标有创建新证书（Create New Certificate）按钮。

source: If you have not turned on Source Control, you can find it in Main Options.
zh_cn: 如果尚未打开“源码管理”，则可以在“主选项”中找到它。

source: If you have selected more than the number specified in this option, then you will be shown a warning, since having too many resources open at one time can cause issues with performance on lower end machines.
zh_cn: 如果你选中的数目超过选项中的数目，你将会看到警告信息，因为同时打开太多的资源在低配电脑上会出出一些性能上的问题。

source: If you mouse over them then you can see the full project name and path, and clicking will open the project.
zh_cn: 如果将鼠标移到上方，你可以看到完整的项目名称和路径，点击 将打开这个项目。

source: If you need to check things more carefully, you can run the game in Debug Mode by clicking the debug run button .
zh_cn: 如果您需要更详细地检查，可以通过单击调试运行按钮在调试模式 下运行游戏。

source: If you remember from earlier, using a 1 will set the first bit.
zh_cn: 如果你还记得之前的情况，使用一个 1 将设置第一个位。

source: If you require Proxy Support for your installation of GameMaker Studio 2, this can be added simply by clicking the Proxy.
zh_cn: 如果你需要为 GameMaker Studio 2 设置代理，可以点击 代理 来添加。

source: If you set this option to "OK" then no message will be shown and the edition will silently fail.
zh_cn: 如果设置此项为“是”（OK），则不会显示该消息，并且无法做这样的编辑。

source: If you think about any rotating object in the "real world", unless it has a motor or is in space, it slows down over time due to the influence of external forces (like friction with the air around it).
zh_cn: 如果您考虑“现实世界”中的任何旋转物体，除非有电机或空间，否则由于外力（如与其周围的空气的摩擦）的影响，它会随着时间的推移而减慢。

source: If you use this function to change the size of the game window, the contents of the window will be scaled to fit with a 1:1 ratio to the background canvas which will keep the image crisp and clear (although scaled if the window is other than the room or view size).
zh_cn: 如果你使用这个函数改变游戏窗口口的大小，窗口内容将与背景画布以1：1的比例进行调整，以保持图像的清晰和明确（尽管缩放窗口不同于房间或视野）。

source: If you want a more in-depth guide as to how to use the different editors listed here, then you should check out the section of the manual that explains them in more detail here:
zh_cn: 如果您想要更深入地了解如何使用这里列出的不同编辑器，那么您应该在这里查看说明手册里说明更详细的部分：

source: If you want to know more about the advanced functions of the Tile Set Editor, then see the relevant section of the manual.
zh_cn: 如果您想了解更多关于图块集编辑器的高级功能的信息，请 参阅手册的相关章节。

source: If you want to remove a bookmark, you simply need to select the bookmarked window or code line and then repeat the + + NumberKey[0 - 9] that you used to create it.
zh_cn: 如果要删除书签，只需要选择已加书签的窗口或代码行，然后重复用于创建书签的组合键 + + 小键盘[0 - 9] 即可。

source: If you wish to go back to the default behaviour (ie: no mimimum), then use a value of -1.
zh_cn: 如果想要回到默认的情况（比如没有最小值限制），只要使用值-1就可以。

source: If your proxy does require a username and/or password, then you'll need to add them in to the fields shown in the window above.
zh_cn: 如果你的代理需要用户名和密码，那么请将它们填入上图字段中。

source: If, after changing the options here to customise GameMaker Studio 2 to your own tastes, you wish to back up the preferences that you have set you need to go to the folder %AppData%/GameMakerStudio2/<your_account_name>/ and then copy the following two files to a safe place:
zh_cn: 如果，在依据你的个人喜好改动过这里的选项来自定义GameMaker Studio 2之后，你希望备份你所设定的偏好设置，那么你需要前往文件夹%AppData%/GameMakerStudio2/<your_account_name>/，并将下面两个文件复制到比较安全的位置：

source: Image
zh_cn: 图像

source: Image Alpha
zh_cn: 图像透明度

source: Image Blend Colour
zh_cn: 图像混合颜色

source: Image Editor
zh_cn: 图像编辑器

source: Image Editor: {0}
zh_cn: 图像编辑器：{0}

source: Image Files
zh_cn: 图片文件

source: Image Index
zh_cn: 图像索引

source: Image Rotation
zh_cn: 图像旋转

source: Image Scaling
zh_cn: 图像缩放

source: Image:
zh_cn: 图像：

source: Images
zh_cn: 图片

source: Images:
zh_cn: 图片：

source: Import
zh_cn: 导入

source: Import / Export
zh_cn: 导入 / 导出

source: Import All
zh_cn: 导入全部

source: Import Colours from Sprite:
zh_cn: 从精灵中导入颜色：

source: Import Complete!
zh_cn: 导入完成！

source: Import Completed!
zh_cn: 导入完成！

source: Import Extension
zh_cn: 导入扩展

source: Import Failed
zh_cn: 导入失败

source: Import Files
zh_cn: 导入文件

source: Import Image(s)
zh_cn: 导入图像

source: Import Project
zh_cn: 导入项目

source: Import Project into Repository
zh_cn: 将项目导入库中

source: Import Strip Image
zh_cn: 导入长带图

source: Import all resources to a new project
zh_cn: 将所有资源导入到一个新项目

source: Import colours from sprite:
zh_cn: 从精灵中导入色板：

source: Import extension
zh_cn: 导入扩展

source: Import from Mac
zh_cn: 从Mac导入

source: Import image
zh_cn: 导入图像

source: Import image and convert to Tilemap
zh_cn: 导入图片并转化为图块地图（Tilemap）。

source: Import image(s)
zh_cn: 导入图片

source: Import legacy resources: {0}
zh_cn: 导入旧资源：{0}

source: Import marketplace package assets instead of adding a datafile?
zh_cn: 导入市场扩展包资产而不是添加一个数据文件？

source: Import marketplace package?
zh_cn: 导入市场扩展包吗？

source: Import nmeta file
zh_cn: 导入 nmeta 文件

source: Import options
zh_cn: 导入选项

source: Import resources: {0}
zh_cn: 导入资源： {0}

source: Import the project instead of adding a datafile?
zh_cn: 导入项目而不是添加一个数据文件？

source: Import the project?
zh_cn: 导入项目？

source: ImportHandler: Unable to find parent project for {0}.
zh_cn: 导入处理器（ImportHandler）：找不到 {0} 的父级项目。

source: Imported image is a different size from the canvas
zh_cn: 导入的图像与画布的大小不同

source: Imported layer depths for room(s) '{0}' were not adequately spaced.
zh_cn: 房间“{0}”的导入层的深度之间没有足够的间隔。

source: Imported layer depths for rooms listed below are not adequately spaced.
zh_cn: 下面列出的房间的导入层的深度之间没有足够的间距。

source: Importing Non-Bitmap Sprites
zh_cn: 导入非位图精灵

source: Importing Project to {0}
zh_cn: 将项目导入{0}

source: Importing files to a sprite is not an undoable action.
zh_cn: 导入文件到精灵中是一个不可撤消的操作。

source: Importing projects is not supported in GameMaker Studio 2 Trial
zh_cn: GameMaker Studio 2 试用版不支持导入项目

source: Importing projects is not supported in the Trial version of GameMaker Studio 2.
zh_cn: GameMaker Studio 2的试用版不支持导入项目。

source: Importing resources...
zh_cn: 导入资源中...

source: Importing strip images will replace the existing sprite frames - do you wish to proceed?
zh_cn: 导入长带图将替换现有的精灵帧 - 你希望继续吗？

source: Importing...
zh_cn: 导入中...

source: In GameMaker Studio 2 you have objects and you have instances.
zh_cn: 在GameMaker Studio 2中你会拥有物体以及实例。

source: In GameMaker: Studio 1.4 you had a separate background resource, where you could add images to be used as backgrounds.
zh_cn: 在GameMaker: Studio 1.4中，你有独立的背景资源，其中你可以添加图片用作背景。

source: In GameMaker Studio 2 all images are considered sprites, and the use you put them too will depend on the layer they are assigned to in the room.
zh_cn: 在GameMaker Studio 2中所有图像都被视为精灵，并且其用途也取决于它们在房间中所被分配的层（Layers）。

source: In App Purchases
zh_cn: 应用内购

source: In GML a function has the form of a function name, followed by the input arguments between brackets and separated by commas (if the function has no input arguments then just brackets are used).
zh_cn: GML函数结构是，一个函数名，后面是括号之内的输入的参数，参数用逗号分隔（如果没有参数，仅仅用括号就可以了）。

source: In Laptop Mode you can pan, scroll and zoom by moving the mouse over an area\nwhile holding Left Control to zoom and Left Alt to pan and scroll.\nUse ${LaptopRHSKeys} for non-mouse interactions while Laptop Mode is enabled.
zh_cn: 在笔记本电脑模式下，您可以平移，滚动和缩放，在区域上移动鼠标同时按住左控制键进行缩放，使用左Alt键进行平移和滚动。\n启用笔记本电脑模式时，使用${LaptopRHSKeys}进行非鼠标交互。

source: In Laptop Mode you can pan, scroll and zoom by moving the mouse over an area\nwhile holding Left Control to zoom and Left Alt to pan and scroll.\nUse Right Control and Right Alt for non-mouse interactions while Laptop Mode is enabled.
zh_cn: 笔记本模式下你可以通过在一个范围内移动鼠标进行平移，滚动和缩放，按住左Ctrl缩放，左Alt平移和滚动。\n笔记本模式开启时使用右Ctrl和右Alt 进行无鼠标的交互。

source: In a number of situations you want to let your instances complete an action depending on a particular value.
zh_cn: 很多情况下，你想要实例根据一个特定值完成一个动作。

source: In a timeline you specify which actions must happen at any specific moment in game time, and you can use all the actions that are available for an object in its different events as well as code.
zh_cn: 在时间轴中，您可以设置在游戏内事件的任何特定时刻要执行那些操作，并且可以在不同的事件以及代码中使用可用于物体的所有操作。

source: In general a sprite will be associated with an object, but you can draw sprites on their own, either from code or in the room editor Asset Layer (more on this later).
zh_cn: 一般而言，一个精灵将与一个物体相关联，当然你可以只绘制一个精灵，无论是用于代码还是在房间编辑器 资源层 （后面会详细介绍）。

source: In general this is only required when debugging and may be requested by support should you have an issue.
zh_cn: 一般地，这些内容只在调试的时候是需要的，并且在你遇到问题的时候可以请求支持。

source: In general this option is used for testing due to its faster build times, but it does not offer the same performance boost that using the YYC option (if available) offers.
zh_cn: 一般来说，此选项可以更快的构建来用于测试，但它不能像YYC一样进行性能提升。

source: In general you can click the left mouse button to select anything, use + to select multiple items, hold to drag items into different docks or onto the workspaces, and also the to open context specific menus.
zh_cn: 通常地，你可以点击鼠标左键来选择任意东西，使用+进行多选，按住来将项目移动到不同的层叠窗口或工作区（Workspace）上，以及可以打开特定的右键菜单。

source: In general you can click the left mouse button to select anything, use / + to select multiple items, hold to drag items into different docks or onto the workspaces, and also the to open context specific menus.
zh_cn: 通常你可以点击鼠标左键选择任何东西 /使用 + 选中多个项目，按住 拖拽项目到不同的停靠栏或者工作区，以及这个 可以打开特定的右键菜单。

source: In general you'll want small sound effects to be WAV and larger effects or music to be MP3 or OGG.
zh_cn: 一般来说，小规格的声音效果一般是 WAV 格式，而大规格的声音效果以及音乐则使用 MP3 或 OGG 格式。
